app/views/book_comments/_index.html.erb

<table class="table book_comment">
  <% book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]