app/views/books/_index.html.erb

        </td>
        <td>コメント数：<%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]