app/controllers/favorites_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @favorite = current_user.favorites.create(book_id: params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["book_id", 2], ["created_at", "2021-08-09 06:21:46.795610"], ["updated_at", "2021-08-09 06:21:46.795610"]]

  def destroy
    @book = Book.find(params[:book_id])
    @favorite = current_user.favorites.find_by(book_id: @book.id)
    @favorite.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 14]]